cask_args appdir: '/Applications'
tap 'caskroom/versions'

cask '1password'
cask 'alfred'
cask 'android-sdk'
cask 'android-studio'
cask 'atom'
cask 'bettertouchtool'
cask 'cyberduck'
cask 'discord'
cask 'dropbox'
cask 'firefox'
cask 'genymotion'
cask 'gitter'
cask 'google-chrome'
cask 'intel-haxm'
cask 'istat-menus'
cask 'iterm2'
cask 'java'
cask 'joinme'
cask 'lastpass'
cask 'ngrok'
cask 'recordit'
cask 'slack-beta'
cask 'spotify'
cask 'vlc'
cask 'xquartz'
cask 'zoomus'

# Local formulae
tap 'caskroom/local-casks', Dir.pwd
cask 'fuze'

# Formulae
tap 'homebrew/science'

brew 'autojump'
brew 'bash-completion'
brew 'coreutils'
brew 'elasticsearch', restart_service: true
brew 'git'
brew 'gpg-agent'
brew 'gpg'
brew 'heroku'
brew 'hugo'
brew 'imagemagick@6' # See: http://stackoverflow.com/a/41678770/825269
brew 'lastpass-cli', args: ['with-pinentry']
brew 'memcached', restart_service: true
brew 'mongo', restart_service: true
brew 'neo4j', restart_service: true
brew 'node'
brew 'npm'
brew 'nvm'
brew 'openssl'
brew 'phantomjs'
brew 'postgresql', restart_service: true
brew 'qt55'
brew 'r'
brew 'redis', restart_service: true
brew 'tree'
brew 'watchman'
brew 'yarn'
