cask_args appdir: '/Applications'
tap 'caskroom/versions'
tap 'caskroom/cask'

# Core Homebrew
brew 'autoconf'
brew 'autojump'
brew 'automake'
brew 'bash'
brew 'bash-completion'
brew 'bazel'
brew 'cairo'
brew 'coreutils'
brew 'elasticsearch'
brew 'entr'
brew 'fontconfig'
brew 'freetype'
brew 'gcc'
brew 'gdbm'
brew 'gettext'
brew 'ghostscript'
brew 'git'
brew 'glib'
brew 'gmp'
brew 'graphicsmagick'
brew 'heroku'
brew 'heroku-node'
brew 'hugo'
brew 'icu4c'
brew 'imagemagick@6'
brew 'isl'
brew 'jasper'
brew 'jpeg'
brew 'jq'
brew 'lbzip2'
brew 'leptonica'
brew 'libevent'
brew 'libffi'
brew 'libgpg-error'
brew 'libksba'
brew 'libmpc'
brew 'libpng'
brew 'libsodium'
brew 'libtiff'
brew 'libtool'
brew 'libyaml'
brew 'little-cms2'
brew 'memcached'
brew 'mpfr'
brew 'mysql@5.7'
brew 'node'
brew 'nspr'
brew 'nss'
brew 'nvm'
brew 'oniguruma'
brew 'openblas'
brew 'openjpeg'
brew 'openssl'
brew 'openssl@1.1'
brew 'parallel'
brew 'pcre'
brew 'pcre2'
brew 'pixman'
brew 'pkg-config'
brew 'poppler'
brew 'python'
brew 'python@2'
brew 'r'
brew 'readline'
brew 'redis'
brew 'sqlite'
brew 'terraform'
brew 'tesseract'
brew 'tree'
brew 'watchexec'
brew 'watchman'
brew 'xz'
brew 'yarn'

# Cask Apps
cask 'alfred'
cask 'atom'
cask 'docker'
cask 'expo-xde'
cask 'firefox'
cask 'iterm2'
cask 'java'
cask 'java8'
cask 'monodraw'
cask 'spectacle'
cask 'sublime-text2'
cask 'tabula'
cask 'visual-studio-code'

